
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.git.github_actions_secret.devops_challenge_aws_access_key_id has been deleted
  - resource "github_actions_secret" "devops_challenge_aws_access_key_id" {
      - created_at      = "2025-02-02 18:10:04 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:AWS_ACCESS_KEY_ID" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "AWS_ACCESS_KEY_ID" -> null
      - updated_at      = "2025-02-02 18:10:04 +0000 UTC" -> null
    }

  # module.git.github_actions_secret.devops_challenge_aws_secret_access_key has been deleted
  - resource "github_actions_secret" "devops_challenge_aws_secret_access_key" {
      - created_at      = "2025-02-02 18:10:05 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "AWS_SECRET_ACCESS_KEY" -> null
      - updated_at      = "2025-02-02 18:10:05 +0000 UTC" -> null
    }

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
      ~ allow_squash_merge          = true -> false
      ~ delete_branch_on_merge      = true -> false
      ~ etag                        = "W/\"2b516d23525fd63905f2184e0fb6f11772ea1a4bbc5613cf035296cb2142146e\"" -> "W/\"e5caea4c0fbdef7761a002bf04415787def4fec8940c62c6b60f26336f51e0c8\""
        id                          = "devops-challenge-teamsoft"
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
        name                        = "devops-challenge-teamsoft"
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
        # (25 unchanged attributes hidden)

      - security_and_analysis {

          - secret_scanning {
              - status = "enabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.git.data.github_actions_public_key.devops_challenge will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "devops_challenge"  {
      ~ id         = "3380204578043523366" -> (known after apply)
      ~ key        = "6KhFp9cX4FWmiJnIyESWGFYpJT7g7VHSh586DKDmhyw=" -> (known after apply)
      ~ key_id     = "3380204578043523366" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.git.github_actions_secret.devops_challenge_aws_access_key_id will be created
  + resource "github_actions_secret" "devops_challenge_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_aws_secret_access_key will be created
  + resource "github_actions_secret" "devops_challenge_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.git.github_repository.devops_challenge will be updated in-place
  ~ resource "github_repository" "devops_challenge" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "devops-challenge-teamsoft"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "devops-challenge-teamsoft"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (26 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform plan*